
到底是在做什么
组织起来做什么
常见的，可以理解的语句，比如说数组，dict，str，file，操作，常见操作包括什么

一个是封装的对象，其实也是这些操作组合
类对象逻辑，就是理解成一些基础数据组成的结构，还有比如file
比如一个常见类型的文件，包括数据处理

比如想象成成员是标量，比如数字，字符串，或者dict加数组的方式
一种是class级别的，一种是object级别的

如果是调用，就是两种方式
一种是导入的已经是对象，一种是类调用
导入的使用有几种
自身定义的使用有几种
导入的执行是一个重要步骤

多重结构调用
以及 实现方式

标量的东西 有哪些
可以理解的有哪些

意义点全覆盖的概念

各个模块的写法
一个是防止命名空间污染

一个是class的使用情况有哪些
一个是对象使用情况有哪些

对象 类 作为参数 返回
作为属性

类的父类的概念
也就是共享一些属性和方法

typing的几种表达方式

各种模式 或者方式
class 传统的是一种
里面是标量的属性

有一种dict，key是类属性，value是class
AGENT_TO_CLASS={
AgentType.ZERO_SHOT_REACT_DESCRIPTION: ZeroShotAgent,
}

定义类属性与对象属性的不同
直接引用类属性

参数里面的* 分隔符的意义

